<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c7{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c6{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:13pt;font-family:"Arial";font-style:normal}.c8{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c5{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c4{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c1{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c3{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c1 doc-content"><p class="c8"><span class="c6">On Language Models</span></p><p class="c5"><span class="c0">Language models typically predict outputs sequentially, a process often referred to as &quot;next-token prediction.&quot; For instance, in the text domain, these models generate content token by token, whereas in the image domain, they produce outputs patch by patch. It is important to note that there are differences between language models for text and images, although this discussion will not delve deeply into these distinctions. A significant limitation of the next-token prediction method is that once a token has been generated, it cannot be revised; the model can only operate on subsequent tokens.</span></p><p class="c5"><span class="c0">However, is this next-token prediction strategy truly effective? Does it align with human behavior? It seems unlikely. Consider the human drawing process for illustration. Humans do not typically draw an image patch by patch. Instead, they start with a global sketch and refine it through multiple iterations. They are able to revise any part of the image at any point in the process. Similarly, when writing an article, humans are not confined to constructing sentences word by word; they can revisit and revise previously written words at any time if they deem them suboptimal. We often cannot ascertain the adequacy of our current words until we have written subsequent ones.</span></p><p class="c5"><span class="c0">This prompts a reconsideration of the next-token prediction algorithm, which is often considered a cornerstone for the development of Artificial General Intelligence (AGI).</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Attached: Translation into Chinese is done by GPT4.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c4"><span class="c7">&#20851;&#20110;&#35821;&#35328;&#27169;&#22411;</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">&#35821;&#35328;&#27169;&#22411;&#36890;&#24120;&#20197;&#24207;&#21015;&#26041;&#24335;&#39044;&#27979;&#36755;&#20986;&#65292;&#36825;&#19968;&#36807;&#31243;&#36890;&#24120;&#34987;&#31216;&#20026;&ldquo;&#19979;&#19968;&#20010;&#35789;&#39044;&#27979;&rdquo;&#12290;&#20363;&#22914;&#65292;&#22312;&#25991;&#26412;&#39046;&#22495;&#65292;&#36825;&#20123;&#27169;&#22411;&#36880;&#20010;&#35789;&#35821;&#22320;&#29983;&#25104;&#20869;&#23481;&#65307;&#22312;&#22270;&#20687;&#39046;&#22495;&#65292;&#21017;&#36880;&#20010;&#21306;&#22359;&#22320;&#20135;&#29983;&#36755;&#20986;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25991;&#26412;&#21644;&#22270;&#20687;&#30340;&#35821;&#35328;&#27169;&#22411;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#65292;&#23613;&#31649;&#26412;&#35752;&#35770;&#19981;&#20250;&#28145;&#20837;&#25506;&#35752;&#36825;&#20123;&#21306;&#21035;&#12290;&#19979;&#19968;&#20010;&#35789;&#39044;&#27979;&#26041;&#27861;&#30340;&#19968;&#20010;&#37325;&#22823;&#38480;&#21046;&#26159;&#19968;&#26086;&#29983;&#25104;&#20102;&#19968;&#20010;&#35789;&#35821;&#65292;&#23601;&#26080;&#27861;&#23545;&#20854;&#36827;&#34892;&#20462;&#25913;&#65307;&#27169;&#22411;&#21482;&#33021;&#23545;&#21518;&#32493;&#35789;&#35821;&#36827;&#34892;&#25805;&#20316;&#12290;</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">&#28982;&#32780;&#65292;&#36825;&#31181;&#19979;&#19968;&#20010;&#35789;&#39044;&#27979;&#31574;&#30053;&#30495;&#30340;&#26377;&#25928;&#21527;&#65311;&#23427;&#26159;&#21542;&#19982;&#20154;&#31867;&#34892;&#20026;&#19968;&#33268;&#65311;&#30475;&#36215;&#26469;&#24182;&#38750;&#22914;&#27492;&#12290;&#20197;&#20154;&#31867;&#32472;&#30011;&#36807;&#31243;&#20026;&#20363;&#36827;&#34892;&#35828;&#26126;&#12290;&#20154;&#31867;&#36890;&#24120;&#19981;&#20250;&#25353;&#21306;&#22359;&#36880;&#20010;&#32472;&#21046;&#22270;&#20687;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#39318;&#20808;&#32472;&#21046;&#19968;&#20010;&#20840;&#23616;&#33609;&#22270;&#65292;&#28982;&#21518;&#36890;&#36807;&#22810;&#27425;&#36845;&#20195;&#36827;&#34892;&#32454;&#21270;&#12290;&#20182;&#20204;&#21487;&#20197;&#22312;&#20219;&#20309;&#26102;&#20505;&#20462;&#25913;&#22270;&#20687;&#30340;&#20219;&#20309;&#37096;&#20998;&#12290;&#21516;&#26679;&#65292;&#24403;&#25776;&#20889;&#25991;&#31456;&#26102;&#65292;&#20154;&#31867;&#19981;&#21463;&#38480;&#20110;&#36880;&#23383;&#26500;&#36896;&#21477;&#23376;&#65307;&#22914;&#26524;&#35748;&#20026;&#20808;&#21069;&#30340;&#35789;&#35821;&#19981;&#22815;&#29702;&#24819;&#65292;&#20182;&#20204;&#21487;&#20197;&#38543;&#26102;&#22238;&#36807;&#22836;&#21435;&#20462;&#25913;&#12290;&#25105;&#20204;&#36890;&#24120;&#26080;&#27861;&#30830;&#23450;&#24403;&#21069;&#30340;&#35789;&#35821;&#26159;&#21542;&#36275;&#22815;&#22909;&#65292;&#30452;&#21040;&#25105;&#20204;&#20889;&#19979;&#21518;&#32493;&#30340;&#35789;&#35821;&#12290;</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">&#36825;&#20419;&#20351;&#25105;&#20204;&#37325;&#26032;&#24605;&#32771;&#19979;&#19968;&#20010;&#35789;&#39044;&#27979;&#31639;&#27861;&#65292;&#36825;&#19968;&#31639;&#27861;&#24120;&#34987;&#35270;&#20026;&#20154;&#24037;&#36890;&#29992;&#26234;&#33021;&#65288;AGI&#65289;&#21457;&#23637;&#30340;&#22522;&#30707;&#12290;</span></p><p class="c2 c3"><span class="c0"></span></p></body></html>